submissions/stable-trend-m1c-random-online-0657f3f2a6-03a12f9bdd-20260816/repeats/repeat3-npu5/bench.stdout.log
/out/result/resolved_same_spec.json
[same-spec-current] neutral cwd: /out/tmp
[same-spec-current] vllm cache root: /out/vllm-cache
[same-spec-current] runtime model source: /data/shared_models/Qwen2.5-14B-Instruct
[same-spec-current] resolved spec file: /out/result/resolved_same_spec.json
[same-spec-current] benchmark type: serve
[same-spec-current] benchmark endpoint: 127.0.0.1:30005
[same-spec-current] waiting for current same-spec server at 127.0.0.1:30005 (0s/900s)
[same-spec-current] waiting for current same-spec server at 127.0.0.1:30005 (30s/900s)
[same-spec-current] waiting for current same-spec server at 127.0.0.1:30005 (60s/900s)
[same-spec-current] waiting for current same-spec server at 127.0.0.1:30005 (90s/900s)
[same-spec-current] waiting for current same-spec server at 127.0.0.1:30005 (120s/900s)
[same-spec-current] readiness probe failed: http://127.0.0.1:30005/health (ConnectionRefusedError: [Errno 111] Connection refused)
[same-spec-current] readiness probe failed: http://127.0.0.1:30005/ping (ConnectionRefusedError: [Errno 111] Connection refused)
[same-spec-current] readiness probe failed: http://127.0.0.1:30005/v1/models (ConnectionRefusedError: [Errno 111] Connection refused)
---- same-spec server log progress at 120s: /out/result/server-attempt-logs/server-attempt-1.stdout.log (last 40 lines) ----
(APIServer pid=1130) INFO 08-17 07:55:41 [kernel.py:286] Final IR op priority after setting platform defaults: IrOpPriorityConfig(rms_norm=['native'], fused_add_rms_norm=['native'])
(APIServer pid=1130) INFO 08-17 07:55:41 [utils.py:203] No quantization signature detected from model files for "/data/shared_models/Qwen2.5-14B-Instruct". The model will be loaded as float. To force a quantization method, pass "--quantization <method>" explicitly.
(APIServer pid=1130) WARNING 08-17 07:55:41 [platform.py:1183] GPU-specific parameter is not supported on Ascend. parameter=disable_cascade_attn, value=True, action: resetting to False.
(APIServer pid=1130) INFO 08-17 07:55:41 [ascend_config.py:914] Dynamic EPLB is False
(APIServer pid=1130) INFO 08-17 07:55:41 [ascend_config.py:915] The number of redundant experts is 0
(APIServer pid=1130) INFO 08-17 07:55:41 [utils.py:1458] Block size is set to 128 if prefix cache or chunked prefill is enabled.
(APIServer pid=1130) INFO 08-17 07:55:41 [platform.py:893] Set PYTORCH_NPU_ALLOC_CONF=expandable_segments:True
(APIServer pid=1130) INFO 08-17 07:55:41 [compilation.py:312] Enabled custom fusions: norm_quant, act_quant
INFO 08-17 07:55:55 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 08-17 07:55:55 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 08-17 07:55:55 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 08-17 07:55:55 [__init__.py:246] Platform plugin ascend is activated
INFO 08-17 07:55:55 [platform.py:60] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
(EngineCore pid=1324) 2026-08-17 07:56:06,823 - 1324 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.21.0+empty: default 1
(EngineCore pid=1324) INFO 08-17 07:56:06 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
(EngineCore pid=1324) INFO 08-17 07:56:06 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
(EngineCore pid=1324) INFO 08-17 07:56:06 [core.py:114] Initializing a V1 LLM engine (v0.21.0) with config: model='/data/shared_models/Qwen2.5-14B-Instruct', speculative_config=None, tokenizer='/data/shared_models/Qwen2.5-14B-Instruct', skip_tokenizer_init=False, tokenizer_mode=auto, revision=None, tokenizer_revision=None, trust_remote_code=False, dtype=torch.float16, max_seq_len=32768, download_dir=None, load_format=auto, tensor_parallel_size=1, pipeline_parallel_size=1, data_parallel_size=1, decode_context_parallel_size=1, dcp_comm_backend=ag_rs, disable_custom_all_reduce=True, quantization=None, quantization_config=None, enforce_eager=False, enable_return_routed_experts=False, kv_cache_dtype=auto, device_config=npu, structured_outputs_config=StructuredOutputsConfig(backend='auto', disable_any_whitespace=False, disable_additional_properties=False, reasoning_parser='', reasoning_parser_plugin='', enable_in_reasoning=False), observability_config=ObservabilityConfig(show_hidden_metrics_for_version=None, otlp_traces_endpoint=None, collect_detailed_traces=None, kv_cache_metrics=False, kv_cache_metrics_sample=0.01, cudagraph_metrics=False, enable_layerwise_nvtx_tracing=False, enable_mfu_metrics=False, enable_mm_processor_stats=False, enable_logging_iteration_details=False, jit_monitor_mode='warn', jit_monitor_verbose=False), seed=0, served_model_name=/data/shared_models/Qwen2.5-14B-Instruct, enable_prefix_caching=True, enable_chunked_prefill=True, pooler_config=None, compilation_config={'mode': <CompilationMode.VLLM_COMPILE: 3>, 'debug_dump_path': None, 'cache_dir': '', 'compile_cache_save_format': 'binary', 'backend': 'vllm_ascend.compilation.compiler_interface.AscendCompiler', 'custom_ops': ['all'], 'ir_enable_torch_wrap': False, 'splitting_ops': ['vllm::unified_attention_with_output', 'vllm::unified_mla_attention_with_output', 'vllm::mamba_mixer2', 'vllm::mamba_mixer', 'vllm::short_conv', 'vllm::linear_attention', 'vllm::plamo2_mamba_mixer', 'vllm::qwen_gdn_attention_core', 'vllm::gdn_attention_core_xpu', 'vllm::olmo_hybrid_gdn_full_forward', 'vllm::kda_attention', 'vllm::sparse_attn_indexer', 'vllm::rocm_aiter_sparse_attn_indexer', 'vllm::deepseek_v4_attention', 'vllm::hpc_rope_norm_forward', 'vllm::unified_kv_cache_update', 'vllm::unified_mla_kv_cache_update', 'vllm::mla_forward', 'vllm::dsa_forward'], 'compile_mm_encoder': False, 'cudagraph_mm_encoder': False, 'encoder_cudagraph_token_budgets': [], 'encoder_cudagraph_max_vision_items_per_batch': 0, 'encoder_cudagraph_max_frames_per_batch': None, 'compile_sizes': [], 'compile_ranges_endpoints': [2048], 'inductor_compile_config': {'enable_auto_functionalized_v2': False, 'size_asserts': False, 'alignment_asserts': False, 'scalar_asserts': False, 'combo_kernels': True, 'benchmark_combo_kernel': True}, 'inductor_passes': {}, 'cudagraph_mode': <CUDAGraphMode.FULL_AND_PIECEWISE: (2, 1)>, 'cudagraph_num_of_warmups': 1, 'cudagraph_capture_sizes': [1, 2, 4, 8, 16, 24, 32, 40, 48, 56, 64, 72, 80, 88, 96, 104, 112, 120, 128, 136, 144, 152, 160, 168, 176, 184, 192, 200, 208, 216, 224, 232, 240, 248, 256], 'cudagraph_copy_inputs': False, 'cudagraph_specialize_lora': True, 'use_inductor_graph_partition': False, 'pass_config': {'fuse_norm_quant': True, 'fuse_act_quant': True, 'fuse_attn_quant': False, 'enable_sp': False, 'fuse_gemm_comms': False, 'fuse_allreduce_rms': False, 'fuse_rope_kvcache_cat_mla': False, 'fuse_act_padding': False}, 'max_cudagraph_capture_size': 256, 'dynamic_shapes_config': {'type': <DynamicShapesType.BACKED: 'backed'>, 'evaluate_guards': False, 'assume_32_bit_indexing': False}, 'local_cache_dir': None, 'fast_moe_cold_start': True, 'static_all_moe_layers': []}, kernel_config=KernelConfig(ir_op_priority=IrOpPriorityConfig(rms_norm=['native'], fused_add_rms_norm=['native']), enable_flashinfer_autotune=True, enable_cutedsl_warmup=True, moe_backend='auto', linear_backend='auto')
(EngineCore pid=1324) INFO 08-17 07:56:09 [ascend_config.py:914] Dynamic EPLB is False
(EngineCore pid=1324) INFO 08-17 07:56:09 [ascend_config.py:915] The number of redundant experts is 0
(EngineCore pid=1324) INFO 08-17 07:56:11 [parallel_state.py:1692] world_size=1 rank=0 local_rank=0 distributed_init_method=tcp://192.168.0.84:34251 backend=hccl
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[...]
(EngineCore pid=1324) INFO 08-17 07:56:13 [parallel_state.py:2027] rank 0 in world size 1 is assigned as DP rank 0, PP rank 0, PCP rank 0, TP rank 0, EP rank N/A, EPLB rank N/A
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
(EngineCore pid=1324) INFO 08-17 07:56:14 [model_runner_v1.py:3757] Starting to load model /data/shared_models/Qwen2.5-14B-Instruct...
(EngineCore pid=1324) INFO 08-17 07:56:16 [compilation.py:1068] Using OOT custom backend for compilation.
(EngineCore pid=1324) WARNING 08-17 07:56:16 [utils.py:381] Disable npu_add_rms_norm_bias custom op because libopapi.so misses required symbol(s): aclnnAddRmsNormBias, aclnnAddRmsNormBiasGetWorkspaceSize
(EngineCore pid=1324) INFO 08-17 07:56:16 [backends.py:888] Post-grad pass configuration time: 0.30 s
(EngineCore pid=1324) INFO 08-17 07:56:16 [weight_utils.py:849] Filesystem type for checkpoints: EXT4. Checkpoint size: 27.51 GiB. Available RAM: 1877.08 GiB.
(EngineCore pid=1324) INFO 08-17 07:56:16 [weight_utils.py:872] Auto-prefetch is disabled because the filesystem (EXT4) is not a recognized network FS (NFS/Lustre). If you want to force prefetching, start vLLM with --safetensors-load-strategy=prefetch.
Loading safetensors checkpoint shards:   0% Completed | 0/8 [00:00<?, ?it/s]
Loading safetensors checkpoint shards:  12% Completed | 1/8 [00:05<00:41,  5.87s/it]
Loading safetensors checkpoint shards:  25% Completed | 2/8 [00:12<00:38,  6.50s/it]
Loading safetensors checkpoint shards:  38% Completed | 3/8 [00:20<00:34,  6.92s/it]
Loading safetensors checkpoint shards:  50% Completed | 4/8 [00:27<00:28,  7.01s/it]
Loading safetensors checkpoint shards:  62% Completed | 5/8 [00:34<00:21,  7.01s/it]
---- end same-spec server log progress ----
[same-spec-current] waiting for current same-spec server at 127.0.0.1:30005 (150s/900s)
[same-spec-current] waiting for current same-spec server at 127.0.0.1:30005 (180s/900s)
[same-spec-current] waiting for current same-spec server at 127.0.0.1:30005 (210s/900s)
[same-spec-current] waiting for current same-spec server at 127.0.0.1:30005 (240s/900s)
[same-spec-current] readiness probe failed: http://127.0.0.1:30005/health (ConnectionRefusedError: [Errno 111] Connection refused)
[same-spec-current] readiness probe failed: http://127.0.0.1:30005/ping (ConnectionRefusedError: [Errno 111] Connection refused)
[same-spec-current] readiness probe failed: http://127.0.0.1:30005/v1/models (ConnectionRefusedError: [Errno 111] Connection refused)
---- same-spec server log progress at 240s: /out/result/server-attempt-logs/server-attempt-1.stdout.log (last 40 lines) ----
(EngineCore pid=1324) INFO 08-17 07:56:16 [backends.py:888] Post-grad pass configuration time: 0.30 s
(EngineCore pid=1324) INFO 08-17 07:56:16 [weight_utils.py:849] Filesystem type for checkpoints: EXT4. Checkpoint size: 27.51 GiB. Available RAM: 1877.08 GiB.
(EngineCore pid=1324) INFO 08-17 07:56:16 [weight_utils.py:872] Auto-prefetch is disabled because the filesystem (EXT4) is not a recognized network FS (NFS/Lustre). If you want to force prefetching, start vLLM with --safetensors-load-strategy=prefetch.
Loading safetensors checkpoint shards:   0% Completed | 0/8 [00:00<?, ?it/s]
Loading safetensors checkpoint shards:  12% Completed | 1/8 [00:05<00:41,  5.87s/it]
Loading safetensors checkpoint shards:  25% Completed | 2/8 [00:12<00:38,  6.50s/it]
Loading safetensors checkpoint shards:  38% Completed | 3/8 [00:20<00:34,  6.92s/it]
Loading safetensors checkpoint shards:  50% Completed | 4/8 [00:27<00:28,  7.01s/it]
Loading safetensors checkpoint shards:  62% Completed | 5/8 [00:34<00:21,  7.01s/it]
Loading safetensors checkpoint shards:  75% Completed | 6/8 [00:41<00:14,  7.13s/it]
Loading safetensors checkpoint shards:  88% Completed | 7/8 [00:49<00:07,  7.29s/it]
Loading safetensors checkpoint shards: 100% Completed | 8/8 [00:51<00:00,  5.60s/it]
Loading safetensors checkpoint shards: 100% Completed | 8/8 [00:51<00:00,  6.42s/it]
(EngineCore pid=1324) 
(EngineCore pid=1324) INFO 08-17 07:57:08 [default_loader.py:430] Loading weights took 51.40 seconds
(EngineCore pid=1324) INFO 08-17 07:57:09 [model_runner_v1.py:3833] Loading model weights took 27.5350 GB
(EngineCore pid=1324) INFO 08-17 07:57:09 [model_runner_v1.py:3860] Model runner load_model total time: 54.75 seconds
(EngineCore pid=1324) INFO 08-17 07:57:09 [interface.py:620] Setting kv cache block size to 128 for CUSTOM backend.
(EngineCore pid=1324) INFO 08-17 07:57:18 [compiler_interface.py:248] AscendCompiler hash factors: {'torch_npu_version': '2.10.0', 'enable_npugraph_ex': False, 'enable_static_kernel': False}
(EngineCore pid=1324) INFO 08-17 07:57:18 [backends.py:1116] Using cache directory: /out/vllm-cache/torch_compile_cache/4d1ed7f52e/rank_0_0/backbone for vLLM's torch.compile
(EngineCore pid=1324) INFO 08-17 07:57:18 [backends.py:1175] Dynamo bytecode transform time: 8.61 s
(EngineCore pid=1324) INFO 08-17 07:57:34 [backends.py:393] Compiling a graph for compile range (1, 2048) takes 15.63 s
(EngineCore pid=1324) INFO 08-17 07:57:38 [decorators.py:713] saved AOT compiled function to /out/vllm-cache/torch_compile_cache/torch_aot_compile/51ddd1858f036f3129cd08f50115830387fd2a0891d09de7f6cdd154996dbc33/rank_0_0/model
(EngineCore pid=1324) INFO 08-17 07:57:38 [monitor.py:53] torch.compile took 29.27 s in total
(EngineCore pid=1324) INFO 08-17 07:58:04 [monitor.py:81] Initial profiling/warmup run took 26.16 s
(EngineCore pid=1324) INFO 08-17 07:58:06 [gpu_model_runner.py:6549] Profiling CUDA graph memory: PIECEWISE=35 (largest=256), FULL=35 (largest=256)
(EngineCore pid=1324) INFO 08-17 07:58:12 [gpu_model_runner.py:6654] Estimated CUDA graph memory: 0.95 GiB total
(EngineCore pid=1324) INFO 08-17 07:58:13 [worker.py:803] Available KV cache memory: 7.69 GiB
(EngineCore pid=1324) INFO 08-17 07:58:13 [worker.py:819] ACL graph memory profiling is enabled (default since v0.22.1). The current --gpu-memory-utilization=0.6000 is equivalent to --gpu-memory-utilization=0.5844 without ACL graph memory profiling. To maintain the same effective KV cache size as before, increase --gpu-memory-utilization to 0.6156. To disable, set VLLM_MEMORY_PROFILER_ESTIMATE_CUDAGRAPHS=0.
(EngineCore pid=1324) INFO 08-17 07:58:13 [kv_cache_utils.py:2203] GPU KV cache size: 41,984 tokens
(EngineCore pid=1324) INFO 08-17 07:58:13 [kv_cache_utils.py:2204] Maximum concurrency for 32,768 tokens per request: 1.28x
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE): 100%|██████████| 35/35 [00:16<00:00,  2.16it/s]
Capturing CUDA graphs (decode, FULL): 100%|██████████| 35/35 [00:08<00:00,  3.97it/s]
(EngineCore pid=1324) INFO 08-17 07:58:40 [gpu_model_runner.py:6722] Graph capturing finished in 26 secs, took 0.69 GiB
(EngineCore pid=1324) INFO 08-17 07:58:40 [worker.py:984] ACL graph pool memory: 0.69 GiB (actual), 0.95 GiB (estimated), difference: 0.26 GiB (37.8%).
(EngineCore pid=1324) INFO 08-17 07:58:40 [worker.py:1029] Free memory on device (60.6/60.96 GiB) on startup. Desired GPU memory utilization is (0.6, 36.57 GiB). Actual usage: 27.54 GiB for weights, 0.23 GiB for peak activation, 0.16 GiB for non-torch memory, 0.69 GiB for NPU graph memory. Replace gpu_memory_utilization with `--kv-cache-memory=8384156160` (7.81 GiB) to fit into requested memory, or `--kv-cache-memory=34185441792` (31.84 GiB) to fully utilize NPU free memory. Current KV cache memory: 7.69 GiB.
(EngineCore pid=1324) INFO 08-17 07:58:42 [cpu_binding.py:389] [cpu_bind_mode] mode=topo_affinity rank=0 visible_npus=[5]
(EngineCore pid=1324) INFO 08-17 07:58:42 [cpu_binding.py:454] The CPU allocation plan is as follows:
(EngineCore pid=1324) INFO 08-17 07:58:42 [cpu_binding.py:459] NPU5: main=[26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45]  acl=[46]  release=[[47]]
(EngineCore pid=1324) INFO 08-17 07:58:42 [cpu_binding.py:485] [migrate] NPU:5 -> NUMA [1]
---- end same-spec server log progress ----
[same-spec-current] current same-spec server became ready after 252s
INFO 08-17 07:59:37 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 08-17 07:59:37 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 08-17 07:59:37 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 08-17 07:59:37 [__init__.py:246] Platform plugin ascend is activated
INFO 08-17 07:59:37 [platform.py:60] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
Namespace(trust_remote_code=False, seed=0, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=30005, endpoint='/v1/completions', header=None, max_concurrency=None, model='/data/shared_models/Qwen2.5-14B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/out/result', result_filename='raw_benchmark_result.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-aa450d32-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=900, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-17 07:59:48 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Waiting for endpoint to become up in 900 seconds
 |          | 00:13 elapsed, 2520:22:01 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [03:28<00:00,  1.04s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  208.54    
Total input tokens:                      204800    
Total generated tokens:                  51200     
Request throughput (req/s):              0.96      
Output token throughput (tok/s):         245.51    
Peak output token throughput (tok/s):    504.00    
Peak concurrent requests:                19.00     
Total token throughput (tok/s):          1227.56   
---------------Time to First Token----------------
Mean TTFT (ms):                          234.54    
Median TTFT (ms):                        213.07    
P99 TTFT (ms):                           422.24    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.52     
Median TPOT (ms):                        37.78     
P99 TPOT (ms):                           41.89     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.52     
Median ITL (ms):                         33.86     
P99 ITL (ms):                            125.51    
==================================================
artifact: /out/result/submission/run_leaderboard.json
manifest: /out/result/submission/leaderboard_manifest.json
[same-spec-current] exported leaderboard artifact to /out/result/submission
[same-spec-current] stopping managed current same-spec wrapper: 1129 1130 1323 1324 640 641